# DimLabelGpShow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimLabelGpShow Property
ParameterTypeId Class See Also
---
"Show Label in View"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimLabelGpShow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimLabelGpShow As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimLabelGpShow {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace